{
  "title": "Tbibek fi Jibek: Building Practical AI for Healthcare Access",
  "author": "Radiant Group",
  "categories": ["Radiant", "Healthcare AI", "Applied Research"],
  "post_date": "2026-01-19",
  "update_date": "2026-01-19",
  "slug": "tbibek-fi-jibek-practical-healthcare-ai",
  "excerpt": "How Radiant designed modular, deployable AI systems to improve healthcare orientation and accessibility in Tunisia.",
  "readTime": "16 min read",
  "content": "## Context\nMost healthcare AI systems fail silently. Not because their models are inaccurate, but because their systems are not designed for real operational environments.\n\nIn many research prototypes, success is defined by benchmark performance or validation accuracy. However, healthcare environments introduce challenges that benchmarks rarely capture: fragmented data pipelines, heterogeneous users, limited infrastructure, and high consequences of error.\n\nHealthcare settings are inherently complex. Data is incomplete or noisy, users range from clinicians to non-experts, and decisions require justification rather than blind prediction. Tbibek fi Jibek was created to confront this reality directly.\n\nRather than asking how to build a more accurate model, we asked a different question: how do we build AI systems that remain useful when deployed under real constraints?\n\n## Problem Statement\nHealthcare-oriented AI systems often assume ideal conditions: abundant labeled data, stable infrastructure, high-end hardware, and expert users capable of interpreting outputs.\n\nIn practice, none of these assumptions hold. Data is sparse and imbalanced, infrastructure varies widely, and many users require explanations rather than predictions.\n\nThe core problem is therefore not intelligence, but usability. The challenge is not building models that perform well in isolation, but building systems that integrate into real workflows and support decision-making responsibly.\n\n## Why Common Approaches Fail\nA common failure mode in healthcare AI is the monolithic model. These systems attempt to solve perception, reasoning, and decision-making within a single architecture.\n\nWhen such systems fail, the failure is opaque. It becomes impossible to determine whether the issue lies in data quality, representation, model bias, or deployment constraints.\n\nMonolithic systems are also difficult to evaluate. Improvements in one component may degrade another, and updates introduce unpredictable side effects.\n\nIn safety-critical domains like healthcare, this lack of transparency and controllability is unacceptable.\n\n## Design Principles\nOur approach was guided by a small set of non-negotiable principles:\n\n- **Modularity over monoliths**: each component must have a single, well-defined responsibility.\n- **Interpretability over raw accuracy**: outputs must be understandable and justifiable.\n- **Progressive deployment**: systems should improve incrementally without destabilizing existing functionality.\n- **Explicit evaluation and failure analysis**: every component must be testable in isolation.\n\nThese principles shaped every architectural and technical decision.\n\n## System Overview\nTbibek fi Jibek is designed as a system-of-systems. It is composed of independent AI modules, each addressing a specific healthcare-related task.\n\nThe current modules include:\n- Accessibility via Tunisian Sign Language recognition\n- Multimodal clinical assistance combining vision and structured data\n- Nutrition and insulin resistance guidance\n- Dermatology triage and wound analysis\n\nEach module exposes a clear interface and can operate independently. When combined, they form a unified mobile application that provides holistic healthcare orientation.\n\nThis architecture allows modules to evolve independently, enables selective deployment, and limits the impact of failures.\n\n## Technical Choices\nRather than pursuing end-to-end intelligence, we prioritized lightweight representations and task-specific models.\n\nPerception tasks rely on efficient feature extraction rather than heavy raw-data processing. Reasoning tasks are separated from perception and supported by retrieval mechanisms when necessary.\n\nExplicit orchestration logic governs how modules interact, making system behavior predictable and auditable.\n\nThese choices reflect a belief that intelligence should be composed, not entangled.\n\n## Data & Evaluation\nEach module uses domain-appropriate evaluation metrics. For example, accessibility modules emphasize robustness and latency, while clinical assistance modules prioritize calibration and explainability.\n\nEvaluation pipelines are independent, allowing failures to be localized and understood.\n\nRather than optimizing global performance metrics, we focus on error analysis and failure modes, especially in edge cases.\n\n## Limitations\nTbibek fi Jibek is not a diagnostic tool. It does not replace clinicians, nor does it provide definitive medical judgments.\n\nThe system is designed for orientation, assistance, and decision support. Human oversight remains essential.\n\nAcknowledging these limitations is a critical part of responsible deployment.\n\n## Deployment Constraints\nAll design decisions were guided by real-world constraints: limited hardware, variable connectivity, and the need for low-latency interaction.\n\nAccessibility considerations influenced interface design, model size, and response formatting.\n\nDeployment is treated as a first-class concern, not an afterthought.\n\n## Lessons Learned\nThroughout development, one lesson became clear: system design matters more than model complexity.\n\nModularity enables safer iteration, clearer evaluation, and long-term maintainability.\n\nIn healthcare AI, restraint is often more valuable than sophistication.\n\n## Broader Implications\nTbibek fi Jibek reflects a broader shift that healthcare AI must undergo. Moving from demos to dependable systems requires embracing constraints, prioritizing usability, and designing for failure.\n\nThis shift is not purely technical. It is cultural.\n\n## Conclusion\nTbibek fi Jibek is not a finished product. It is a foundation.\n\nA foundation for practical, accessible, and responsible healthcare AI systems that prioritize real-world impact over theoretical perfection."
}

