{
  "title": "Tbibek fi Jibek: Building Practical AI for Healthcare Access",
  "author": "Radiant Group",
  "categories": ["Radiant", "Healthcare AI", "Applied Research"],
  "post_date": "2026-01-19",
  "update_date": "2026-01-19",
  "slug": "tbibek-fi-jibek-practical-healthcare-ai",
  "excerpt": "How Radiant designed modular, deployable AI systems to improve healthcare orientation and accessibility in Tunisia.",
  "readTime": "16 min read",
  "content": "## Context\nMost healthcare AI systems fail silently. Not because their models are inaccurate, but because their systems are not designed for real operational environments.\n\nHealthcare settings are fragmented, data is imperfect, users are diverse, and decisions require justification. Tbibek fi Jibek was created to confront this reality directly.\n\n## Problem Statement\nHealthcare-oriented AI systems often assume ideal conditions: abundant data, stable infrastructure, and expert users. In practice, none of these assumptions hold.\n\nThe challenge is not building intelligence, but building *usable* intelligence.\n\n## Why Common Approaches Fail\nMonolithic architectures collapse multiple responsibilities into a single model. When they fail, it is impossible to diagnose why. They are difficult to evaluate, update, and deploy safely.\n\n## Design Principles\n- Modularity over monoliths\n- Interpretability over raw accuracy\n- Progressive deployment\n- Explicit evaluation and failure analysis\n\n## System Overview\nTbibek fi Jibek is a system-of-systems composed of independent AI modules: accessibility (TunSL), multimodal clinical assistance, nutrition guidance, dermatology triage, and wound analysis.\n\nEach module exposes a clear interface and can operate independently or as part of a unified application.\n\n## Technical Choices\nWe prioritized lightweight representations, task-specific models, and explicit orchestration logic over end-to-end intelligence.\n\n## Data & Evaluation\nEach module uses domain-appropriate metrics and independent evaluation pipelines. Failures are localized and analyzable.\n\n## Limitations\nThe system is not a diagnostic tool. It provides orientation, assistance, and decision support, not clinical authority.\n\n## Deployment Constraints\nDesign decisions were guided by hardware limitations, latency constraints, and accessibility requirements.\n\n## Lessons Learned\nSystems thinking matters more than model complexity. Modularity enables safety and iteration.\n\n## Broader Implications\nHealthcare AI must evolve from demos to dependable systems.\n\n## Conclusion\nTbibek fi Jibek is not a product. It is a foundation for practical, accessible healthcare AI."
}
